#include <iostream>
using namespace std;
int main()
{
	int x, y, z;// ініціалізуєм змінні
	cout << "print x ";
	cin >> x;//вводимо змінну x з клавіатури
	cout << "print y ";
	cin >> y;//вводимо змінну y з клавіатури
	cout << "print z ";
	cin >> z;//вводимо змінну z з клавіатури

	if (x == 0 && y == 0 && z == 0 ||//якщо x = 0 і y=0 і z=0 або
		x == 0 && y == 0 && z == 1 ||//якщо x = 0 і y=0 і z=1 або
		x == 0 && y == 1 && z == 0 ||//якщо x = 0 і y=1 і z=0 або
		x == 0 && y == 1 && z == 1 ||//якщо x = 0 і y=1 і z=1 або
		x == 1 && y == 0 && z == 0 ||//якщо x = 1 і y=0 і z=0 або
		x == 1 && y == 0 && z == 1 ||//якщо x = 1 і y=0 і z=1 або
		x == 1 && y == 1 && z == 0 ||//якщо x = 1 і y=1 і z=0 або
		x == 1 && y == 1 && z == 1//якщо x = 1 і y=1 і z=1 
		) {
		cout << "result is 1";//якщо наша умова справджується виводимо "result is 1"
	}
	else {
		cout << "invalid input";//якщо наша умова не справджується виводимо "wrong"
	}

	system("pause");
	return 0;
}
